---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizes.GetEnumerator
source: html/bf424a5e-1979-0e36-1e78-6ab95620b428.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizes.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<ConduitSize> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.